#1 Перевірка числа на парність

number = int(input("Введіть число для перевірки на парність "))

if number % 2 == 0:
    print(f"Число {number} парне")
else:
    print(f"Число {number} непарне")

#2 Класифікація віку

age = int(input("Введіть свій вік "))

if age < 18:
    print("Ви не повнолітній")
elif 18 <= age < 60:
    print("Ви повнолітній")
else: 
    print("Ви пенсіонер")

#3 Вкладені умови

num = int(input("Введіть число для перевірки на те чи є воно додатнім і парним "))

if num > 0:
    if num % 2 == 0:
        print(f"Число {num} є додатнім і парним")
    else: 
        print(f"Число {num} є додатнім і непарним")
else:
    print(f"Число {num} не додатнє")